Can't delete element that is being edited.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotDeleteEditedElement { get; }
  Visual Basic
Public Shared ReadOnly Property CannotDeleteEditedElement As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotDeleteEditedElement {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace